Repository: Clear-Bible/eng-tpi-tm
Catalog: output.tmx
Source language: en_us
Languages: tpi

source: hungry
tpi: hangre

source: hurry
tpi: hariap

source: hurry up
tpi: hariap

source: hurt
tpi: pen

source: husband
tpi: maritman

source: hut
tpi: haus

source: hypocrite
tpi: tubel

source: I
tpi: mi

source: ice
tpi: ais

source: if
tpi: sapos

source: ignore
tpi: maski

source: ill
tpi: sik

source: illegitimate child
tpi: pikinini bilong rot

source: imitate
tpi: bihainim

source: immediately
tpi: stret nau

source: important
tpi: i bikpela samting

source: impossible
tpi: i hat moa

source: imprison
tpi: kalabusim

source: improve
tpi: kamapim

source: in
tpi: insait long

source: in order to
tpi: bilong

source: in the middle of
tpi: namel long

source: increase
tpi: apim

source: independence
tpi: independens

source: indigenous person
tpi: kanaka

source: industrious person
tpi: man bilong wok

source: information
tpi: toksave

source: injection
tpi: sut

source: injure
tpi: kilim

source: inner tube
tpi: gumi

source: insect
tpi: binatang

source: inside
tpi: insait

source: instead of
tpi: long halivim

source: insult
tpi: nogutim

source: intercourse
tpi: puspus

source: interesting
tpi: i laikim tru

source: interfere
tpi: paulim

source: interpreter
tpi: man i tanim tok ples

source: interrupt
tpi: katim tok

source: interviewer
tpi: intaviua

source: intestines
tpi: liva

source: iron
tpi: ain

source: is
tpi: stap

source: island
tpi: ailan

source: isn't it?
tpi: laka?

source: it
tpi: em

source: it is
tpi: ren i kamdaun or pundaun

source: it would be better if
tpi: mobeta sapos

source: jack
tpi: jek

source: jam
tpi: jem

source: January
tpi: Janueri

source: jaw's harp
tpi: susap

source: jet plane
tpi: smokbalus

source: jew's harp
tpi: susap

source: jewelry
tpi: bilas

source: job
tpi: wok

source: joint
tpi: skru

source: joke
tpi: giaman

source: journey
tpi: wokabaut

source: judge
tpi: jas

source: July
tpi: Julai

source: jump
tpi: kalap

source: June
tpi: Jun

source: jungle
tpi: bus

source: just
tpi: tasol

source: keep
tpi: holim pas

source: kick
tpi: kik

source: kid
tpi: glaman

source: kill
tpi: kilim i dai pinis

source: kilogram
tpi: kilogiram

source: kilometer
tpi: kilomita

source: kind
tpi: kain

source: kiss
tpi: givim kis

source: kitchen
tpi: haus kuk

source: knead bread
tpi: wokim

source: kneel
tpi: nildaun

source: knife
tpi: naip

source: knock at door
tpi: paitim dua

source: know
tpi: save

source: label
tpi: namba

source: lake
tpi: raunwara

source: lamb
tpi: pikinini bilong sipsip

source: lamp
tpi: lam

source: lance a boil
tpi: katim buk

source: lard
tpi: gris bilong pik

source: large
tpi: traipela

source: last
tpi: bihain tru

source: late
tpi: bihaintaim or taim i lus

source: later
tpi: bai

source: laugh
tpi: lap

source: laundry
tpi: haus bilong wasim klos

source: law
tpi: lo

source: lawnmower
tpi: mowa

source: lawyer
tpi: loia

source: laxative
tpi: solmarasin

source: lay down
tpi: slipim

source: lazy man
tpi: lesbaga

source: lead
tpi: go pas long

source: leaf
tpi: lip

source: learn
tpi: lainim

source: least
tpi: liklik tru

source: leather shoes
tpi: su let

source: leave
tpi: lusim

source: leave behind
tpi: larim

source: left
tpi: kais

source: leftovers
tpi: hap kaikai bilong asde

source: leg
tpi: lek

source: lemon
tpi: muli

source: lemonade
tpi: limonad

source: let
tpi: larim

source: letter
tpi: pas

source: lettuce
tpi: letis

source: liar
tpi: man bilong giaman

source: licence
tpi: laisens

source: lick
tpi: likim

source: lid of something
tpi: tuptup

source: lie
tpi: giaman

source: lie down
tpi: slip

source: lie to
tpi: giamanim

source: lift
tpi: liptimupim

source: light
tpi: lait

source: light globe
tpi: kiau

source: lighter
tpi: ston masis

source: lightning
tpi: klaut i lait

source: lime
tpi: muli

source: line
tpi: lain

source: lipstick
tpi: pen bilong maus

source: listen
tpi: harim

source: litre
tpi: lita

source: little
tpi: liklik

source: live
tpi: stap

source: liver
tpi: lewa

source: living person
tpi: laipman

source: lizard
tpi: palai

source: loaf of bread
tpi: bret

source: loafer
tpi: lesbaga

source: loan
tpi: lon

source: local language
tpi: tok ples

source: lock
tpi: lok

source: loincloth
tpi: laplap

source: lolly
tpi: loli

source: long
tpi: longpela

source: longer than
tpi: longpela mo

source: longest
tpi: longpela long olgeta

source: look
tpi: luk

source: loose
tpi: lus

source: lot
tpi: planti

source: loud
tpi: strong

source: loudmouth
tpi: man bilong bikmaus

source: louse
tpi: laus

source: love
tpi: laikim

source: low
tpi: daun

source: luck
tpi: kas

source: lump
tpi: buk

source: lunch
tpi: liklik kaikai or belo

source: lungs
tpi: wetliva

source: Lutheran
tpi: luteran

source: lying down
tpi: slip

source: machine
tpi: masin

source: mad
tpi: longlong

source: magazine
tpi: niuspepa

source: magic
tpi: majik

source: magistrate
tpi: majestret

source: main
tpi: bikpela

source: make
tpi: wokim

source: make fun of
tpi: rabisim

source: Malay apple
tpi: laulau

source: male
tpi: man

source: male prostitute
tpi: pamukman

source: manager
tpi: menaga

source: Manam Island
tpi: ailan Manam

source: manner
tpi: pasin

source: many
tpi: planti

source: March
tpi: Mas

source: marihuana
tpi: spak brus

source: marijuana
tpi: spak brus

source: market
tpi: bung

source: married
tpi: marit

source: marry
tpi: maritim

source: masturbate
tpi: siginim kok

source: matches
tpi: masis

source: mate
tpi: wantok

source: maternal
tpi: kandere

source: may
tpi: me

source: meal
tpi: kaikai

source: mean
tpi: min

source: means
tpi: i min

source: measure
tpi: makim

source: meat
tpi: abus

source: mechanic
tpi: mekenik

source: medical assistant
tpi: dokta

source: medicine
tpi: marasin

source: meet
tpi: bungim

source: meeting
tpi: kibung

source: melon
tpi: melen

source: men & women
tpi: manmeri

source: menstruating
tpi: mun i kilim

source: menu
tpi: pas bilong ol kaikai

source: mercy
tpi: marimari

source: message
tpi: tok

source: messmate
tpi: wansospen

source: metre
tpi: mita

source: middle
tpi: namel

source: midnight
tpi: biknait

source: milk
tpi: susu

source: millimetre
tpi: milimita

source: minibus
tpi: liklik bas

source: minute
tpi: minit

source: mirror
tpi: glas bilong lukluk

source: miserable
tpi: tarangu

source: mission
tpi: misin

source: missionary
tpi: misinare

source: mist
tpi: sno

source: mistake
tpi: i no stret

source: mix
tpi: miksim

source: mixed
tpi: race

source: moiety
tpi: bisnis

source: moment
tpi: minit

source: monastery
tpi: haus pater

source: Monday
tpi: Mande

source: money
tpi: mani

source: month
tpi: mun

source: monument
tpi: makim

source: moon
tpi: mun

source: more
tpi: mo

source: morning
tpi: moningtaim

source: mosque
tpi: haus lotu bilong ol mahomet

source: mosquito
tpi: natnat

source: most
tpi: moa tru

source: mother
tpi: mama

source: motor
tpi: bike

source: mountain
tpi: maunten

source: mouse
tpi: liklik rat

source: moustache
tpi: mausgras

source: mouth
tpi: maus

source: movie camera
tpi: kamera piksa

source: much
tpi: planti

source: muddy place
tpi: ples malomalo

source: muffler
tpi: mafla

source: multicoloured
tpi: makmak

source: mummy
tpi: mama

source: murderer
tpi: kilman

source: museum
tpi: haus bilong tumbuna pasin

source: mushroom
tpi: papai

source: music
tpi: musik or sing sing

source: must
tpi: mas

source: mustard
tpi: mastet

source: mutton
tpi: sipsip

source: my
tpi: asples bilong mi

source: myth
tpi: tok bilong bipo yet

source: name
tpi: nem

source: namesake
tpi: wannem

source: nape of neck
tpi: baksait bilong nek

source: narrow
tpi: i no brait

source: native village
tpi: ples kanaka

source: natural
tpi: samting tru

source: nauseated
tpi: bel i tantanim

source: navel
tpi: hap bel

source: neck
tpi: nek

source: need
tpi: nidim

source: needle
tpi: nil bilong samap

source: nest
tpi: haus bilong pisin

source: never
tpi: i no gat wanpela taim

source: new
tpi: nupela

source: New Zealand
tpi: Niu Silan

source: newspaper
tpi: niuspepa

source: next
tpi: bihain

source: nice
tpi: naispela

source: night
tpi: nait

source: nine
tpi: nain

source: ninety
tpi: nainti

source: no
tpi: nogat

source: no good
tpi: nogut

source: nobody
tpi: i no gat man

source: noise
tpi: nois

source: noodles
tpi: ol nudal

source: noon
tpi: belo kaikai

source: north
tpi: not

source: nose
tpi: nus

source: not
tpi: no

source: not at all
tpi: no . . . tasol

source: notepaper
tpi: pepa bilong raitim leta

source: nothing
tpi: i nogat samting

source: notice
tpi: toksave

source: nought
tpi: nating

source: November
tpi: Novemba

source: now
tpi: nau

source: nuisance
tpi: hambakman

source: number
tpi: namba

source: nun)
tpi: sista

source: nurse
tpi: nes

source: nut
tpi: nat

source: nuts
tpi: galip

source: obtain
tpi: kisim

source: occasionally
tpi: wanpela wanpela taim

source: occupied
tpi: pulap

source: October
tpi: Oktoba

source: offer
tpi: mekim ofa

source: office
tpi: opis

source: oil
tpi: wel

source: ointment
tpi: gris

source: okay
tpi: oke

source: old
tpi: lapun

source: olives
tpi: pikinini diwai oliv

source: on
tpi: antap long

source: on top of
tpi: antap long

source: once
tpi: wanpela taim

source: one
tpi: wan

source: onion
tpi: anien

source: only
tpi: tasol

source: open
tpi: op

source: opera
tpi: kain singsing na danis

source: opinion
tpi: tingting

source: opponent
tpi: birua

source: opposite
tpi: arasait

source: or
tpi: no

source: orange
tpi: switmuli

source: order
tpi: oda

source: ordered
tpi: takim

source: ordinary
tpi: nating

source: origin
tpi: as

source: other
tpi: narapela

source: our
tpi: bilong mipela

source: outboard motor
tpi: autbotmota

source: outpost
tpi: stesin

source: outside
tpi: ausait

source: oven
tpi: aven

source: over
tpi: there

source: overcast
tpi: klaut i pas

source: overcoat
tpi: kotren

source: overcome
tpi: daunim

source: oversee
tpi: bosim

source: overseer on plantation
tpi: bosboi

source: overtake a car
tpi: abrusim ka

source: owe
tpi: gat dinau

source: oyster
tpi: kina

source: oyster shell
tpi: skin bilong kina

source: pacify
tpi: kolim bel

source: pack
tpi: bungim wantaim

source: paddle
tpi: pul long kanu

source: pain
tpi: pen

source: paint
tpi: pen

source: palace
tpi: haus bilong king

source: palm of hand
tpi: insait long han

source: pandanus fruit
tpi: marita

source: papaya
tpi: popo

source: paper
tpi: pepa

source: parakeet
tpi: kalangal

source: parcel
tpi: karamap

source: parents
tpi: papamama

source: park
tpi: gaden bilas

source: parliament
tpi: palamen

source: parrot
tpi: koki

source: part
tpi: pat

source: party
tpi: pati

source: pass car
tpi: mitim ka

source: passenger
tpi: pasindia

source: passport
tpi: paspot

source: past tense marker
tpi: bin

source: pastry
tpi: kek

source: patient
tpi: sikman

source: patio
tpi: veranda

source: pawpaw
tpi: popo

source: pay
tpi: pe

source: peace
tpi: gutpela taim

source: peaceful
tpi: belisi

source: peanut
tpi: kasang

source: pearl
tpi: kiau bilong golip

source: peas
tpi: hebsen

source: pedestrian crossing
tpi: ples wokabaut

source: peeping Tom
tpi: lukstilman

source: pencil
tpi: pensil

source: penis
tpi: kok

source: people
tpi: manmeri

source: pepper
tpi: pepa

source: perch
tpi: nilpis

source: perfume
tpi: sanda

source: perhaps
tpi: ating

source: permit
tpi: pemit

source: persistent offender
tpi: man i go i kam long kot

source: person
tpi: man

source: petrol
tpi: bensin

source: petrol pipe
tpi: mambu bilong bensin

source: pharmacy
tpi: haus marasin

source: photo
tpi: foto

source: photograph
tpi: poto

source: picture
tpi: piksa

source: pie
tpi: pai

source: piece
tpi: hap

source: pig
tpi: pik

source: pigeon
tpi: pisin

source: pile up
tpi: hipim

source: pillow
tpi: pilo

source: pilot
tpi: pailat

source: pineapple
tpi: ananas

source: pink
tpi: ret

source: pipe
tpi: paip

source: pistol
tpi: hangan

source: pity
tpi: marimari

source: place
tpi: hap

source: planet
tpi: liklik mun

source: plant
tpi: planim

source: plantation
tpi: plantesen

source: plastic
tpi: plastik

source: plate
tpi: plet

source: platform
tpi: ples bilong wetim tren

source: play
tpi: pilai

source: playmate
tpi: wanpilai

source: pleasant
tpi: switpela

source: please
tpi: plis

source: plenty
tpi: Planti

source: pliers
tpi: plais

source: PMV
tpi: piemvi

source: point out
tpi: mekim long pinga long

source: poison
tpi: poisen

source: pole
tpi: diwai

source: police
tpi: polis

source: policeman
tpi: polisman

source: polish
tpi: polisim

source: politician
tpi: politisen

source: poor
tpi: nogat moni

source: poor man
tpi: rabisman

source: pork
tpi: pik

source: porter
tpi: kagoboi

source: portion out
tpi: dilim

source: possible
tpi: i ken

source: possum
tpi: kaskas

source: post
tpi: pos

source: post office
tpi: pos opis

source: postcard
tpi: poskat

source: posterior part
tpi: as

source: potato
tpi: poteto

source: pound
tpi: memeim

source: pour
tpi: kapsaitim

source: powder
tpi: paura

source: power
tpi: pawa

source: practise
tpi: traim

source: prawn
tpi: kindam bilong solwara or liklik kindam

source: prayer book
tpi: buk beten

source: preacher
tpi: talatala

source: pregnant
tpi: i gat bel

source: prepare
tpi: redim

source: present
tpi: presen

source: president
tpi: presiden

source: press
tpi: ainim

source: pressure
tpi: cook

source: pressure lamp
tpi: lam bensin

source: pretty
tpi: nais

source: price
tpi: prais

source: priest
tpi: pater

source: primary school
tpi: praimeri skul

source: Prime Minister
tpi: Prai Minista

source: prison
tpi: kalabus

source: prisoner
tpi: kalabusman

source: private
tpi: tambu long olgeta

source: probably
tpi: ating

source: problems
tpi: wari

source: prohibit
tpi: tambuim

source: promise
tpi: promisim

source: promote
tpi: strongim

source: pronged
tpi: supsup bilongbanara

source: propeller
tpi: koropela

source: prophet
tpi: profet

source: prostitute
tpi: pamukmeri

source: proud of
tpi: amamasim

source: province
tpi: provins

source: provoke
tpi: sutim bel

source: public
tpi: bilong olgeta man na meri

source: pull
tpi: pulim

source: pulp
tpi: meme

source: pulverize
tpi: memeim

source: pumpkin
tpi: pamkin

source: puncture
tpi: taia i plat

source: punish
tpi: strafim

source: pure
tpi: klin

source: purple
tpi: hap ret

source: push
tpi: subim

source: put
tpi: putim

source: put on
tpi: pasim

source: pyrethrum
tpi: pairitrum

source: python
tpi: moran

source: Qantas
tpi: Kwantas

source: quantity
tpi: hamas

source: queen
tpi: misis kwin

source: question
tpi: kwesten

source: queue
tpi: lain

source: quick
tpi: hariap

source: quickly
tpi: kwik

source: quite
tpi: liklik

source: quotation
tpi: hap tok

source: race
tpi: resis

source: radiator
tpi: redieita

source: radio
tpi: wailis

source: railway
tpi: tren

source: rain
tpi: ren

source: rainbow
tpi: renbo

source: raincoat
tpi: kotren

source: raining
tpi: ren i kamdaun or pundaun

source: rainy season
tpi: taim bilong ren

source: raise
tpi: apim

source: rape
tpi: pulim

source: rascal
tpi: raskol

source: rather
tpi: liklik

source: rattle
tpi: ratol

source: razor
tpi: resa

source: read
tpi: ridim

source: reader
tpi: rida

source: ready
tpi: redi

source: really
tpi: tru

source: receipt
tpi: risit

source: receive
tpi: kisim

source: record
tpi: rekot

source: record a song
tpi: katim singsing long teprikoda

source: red
tpi: ret

source: reeds
tpi: tiktik

source: reef
tpi: rip

source: refrigerator
tpi: bokis ais

source: register
tpi: rejistarim pas

source: regret
tpi: belhevi

source: release the brake
tpi: legoim brek

source: religion
tpi: lotu

source: remember
tpi: holim long tingting or no lusim tingting

source: rent
tpi: baim

source: repair
tpi: wokim gut

source: repeat
tpi: mekim gen

source: replete
tpi: pulap

source: reply
tpi: bekim tok

source: report
tpi: givim stori

source: research
tpi: rises

source: rest
tpi: malolo

source: result
tpi: ansa

source: return
tpi: go bek

source: ribs
tpi: banis

source: rice
tpi: rais

source: rich
tpi: i gat planti samting

source: ridicule
tpi: tok bilas

source: rifle
tpi: raifol

source: right
tpi: raithan

source: ringworm
tpi: grile

source: ripe
tpi: mau

source: rise
tpi: go antap

source: river
tpi: wara

source: road
tpi: rot

source: roast
tpi: i bin kukim long paia

source: roll a smoke
tpi: tanim smok

source: room
tpi: rum

source: round
tpi: raun

source: row
tpi: pul long kanu

source: rubbish
tpi: pipia

source: rubbish tin
tpi: tin pipia

source: rum
tpi: ram

source: rumour
tpi: tokwin

source: run
tpi: ran

source: rust
tpi: ros

source: s)
tpi: klos meri

source: sack
tpi: autim long wok

source: sad
tpi: sore

source: safe
tpi: i stap gut

source: sago
tpi: saksak

source: sago palm
tpi: saksak

source: sailor
tpi: boskru

source: salt
tpi: sol

source: same
tpi: wankain

source: sandals
tpi: sandal

source: sandwich
tpi: sanwis

source: Saturday
tpi: Sarere

source: sauce
tpi: sos

source: saucepan
tpi: sospen

source: sausage
tpi: sosis

source: saw
tpi: so

source: say
tpi: tok

source: scabies
tpi: kaskas

source: scavenge
tpi: mumutim

source: school
tpi: skul

source: schoolchild
tpi: sumatin

source: schoolmate
tpi: wanskul

source: science
tpi: save

source: scissors
tpi: sisis

source: scold
tpi: krosim

source: scone
tpi: skon

source: scrape
tpi: sikirapim

source: scraps
tpi: pipia

source: screw
tpi: skru

source: sea
tpi: solwara

source: seaside
tpi: nambis

source: seat
tpi: sit

source: second
tpi: namba tu

source: secret
tpi: tok hait

source: secretary
tpi: sekreteri

source: seduce
tpi: pulim

source: see
tpi: lukim

source: seems
tpi: ating

source: seldom
tpi: sampela taim

source: sell
tpi: salim

source: semitrailer
tpi: semitrela

source: send
tpi: salim

source: Sepik River
tpi: wara Sepik

source: September
tpi: Septemba

source: servant
tpi: hausboi

source: service station
tpi: sevis stesin

source: set free
tpi: lusim

source: set the table
tpi: stretim

source: settle stomach
tpi: strongim bel

source: seven
tpi: sevenpela

source: several
tpi: sampela

source: sew
tpi: samapim

source: sew up
tpi: samap

source: shadow
tpi: dewel

source: shake
tpi: seksek

source: shallow
tpi: i no daun

source: shame
tpi: sem

source: shampoo
tpi: sop

source: share out
tpi: skelim

source: shark
tpi: sak

source: sharp
tpi: sap

source: shave
tpi: sepim

source: she
tpi: em

source: sheep
tpi: sipsip

source: sheet
tpi: laplap bilong bet

source: shell
tpi: kina

source: shelter
tpi: ples bilong hait

source: shield
tpi: plang bilong pait

source: ship
tpi: sip

source: shirt
tpi: siot

source: shivering
tpi: skin i guria

source: shoe
tpi: su

source: shoot
tpi: sutim

source: shop
tpi: stua

source: short
tpi: sot

source: shorthand
tpi: sothan

source: shorts
tpi: sotpela trausis

source: shoulder
tpi: sol

source: shovel
tpi: savol

source: show
tpi: soim

source: shower
tpi: waswas

source: shut
tpi: pasim

source: siblings
tpi: bratasusa

source: sick
tpi: sik

source: side
tpi: sait

source: sign
tpi: sain

source: signal
tpi: sain

source: silk
tpi: slika

source: silver
tpi: silva

source: similar
tpi: wankain

source: sin
tpi: pekato

source: since
tpi: bihain long

source: sing
tpi: singsing

source: sister
tpi: susa

source: sister (nurse
tpi: sista

source: sit
tpi: sindaun

source: sit down
tpi: sindaun

source: six
tpi: sikis

source: skin
tpi: sigin

source: skite
tpi: bulsitman

source: sky
tpi: ples bilong klaut

source: slack
tpi: slek

source: slacken
tpi: slekim

source: slap
tpi: solapim

source: sleep
tpi: slip

source: sleepy
tpi: ai i hevi

source: sleeve
tpi: han bilong siot

source: slitgong
tpi: garamut

source: slow
tpi: isi isi

source: slow down
tpi: sloim ka

source: small
tpi: liklik

source: smoke
tpi: smok

source: snake
tpi: snek

source: sneakers
tpi: su gumi

source: snore
tpi: pulim nus

source: snow
tpi: ais

source: soap
tpi: sop

source: soccer
tpi: soka

source: sock
tpi: sok

source: soda
tpi: water

source: soft
tpi: . . . malmalum

source: softdrink
tpi: loliwara

source: soldier
tpi: soldia

source: sole of foot
tpi: ananit bilong lek

source: some
tpi: sampela

source: somebody
tpi: wanpela man o meri

source: something
tpi: samting

source: sometimes
tpi: sampela taim

source: somewhere
tpi: long sampela hap

source: son
tpi: pikinini man

source: soon
tpi: no longtaim

source: sorcery
tpi: sanguma

source: sore
tpi: sua

source: sorry
tpi: sori

source: sort
tpi: kain

source: soup
tpi: sup

source: sour
tpi: soua

source: soursoup
tpi: sausap

source: South
tpi: saut

source: soya sauce
tpi: blaksos

source: space
tpi: spes

source: spade
tpi: spet

source: spare part
tpi: spepat

source: spark
tpi: spak

source: speak
tpi: spik

source: spear
tpi: spia

source: spectacles
tpi: aiglas

source: speed
tpi: spit

source: spell
tpi: kaunim

source: spend
tpi: lusim

source: spiny fish
tpi: nilpis

source: spirit
tpi: masalai

source: spit
tpi: spet

source: spittle
tpi: spet

source: spoil
tpi: bagarapim

source: spoon
tpi: spun

source: sport
tpi: pilai

source: sprain
tpi: tanim skru

source: squatter
tpi: dripman

source: stairs
tpi: lata

source: stamp
tpi: stem

source: stand up
tpi: sanapim

source: star
tpi: sta

source: statement
tpi: hap tok

source: station
tpi: stesin

source: stay
tpi: sindaun or stap

source: steak
tpi: mit

source: steal
tpi: stilim

source: Steamships
tpi: Stimsip

source: steel wool
tpi: stilwul

source: steep
tpi: i go daun tumas

source: steer
tpi: stia

source: steps
tpi: lata

source: stevedore
tpi: wok sip

source: still
tpi: yet

source: stockings
tpi: sokin

source: stone
tpi: ston

source: stop
tpi: dai i stop

source: store
tpi: stua

source: storey
tpi: plo

source: story
tpi: stori

source: stove
tpi: stov

source: straight
tpi: stretpela

source: strainer
tpi: strena

source: strap
tpi: pasim

source: street
tpi: rot

source: strength
tpi: pawa

source: strike a match
tpi: slekim masis

source: string netbag
tpi: bilum

source: strip a bed
tpi: brukim bet

source: strong
tpi: em i pait

source: stubborn
tpi: bikhet

source: stubby
tpi: stabi

source: stuck
tpi: pas

source: student
tpi: studen

source: study
tpi: stadim

source: stupid
tpi: longlong

source: substance
tpi: samting

source: suck finger
tpi: susuim pinga

source: suddenly
tpi: santu

source: sugar
tpi: suga

source: sugarcane
tpi: stik suga

source: suitcase
tpi: paus

source: summit
tpi: antap

source: sun
tpi: san

source: Sunday
tpi: Sande

source: sunglasses
tpi: sanglss

source: support
tpi: sapotim

source: supporter
tpi: sapota

source: suppose
tpi: sapos

source: surprised
tpi: kirap nogut

source: surveyor
tpi: masta mak

source: swamp
tpi: tais

source: sweat
tpi: tuhat

source: sweatshirt
tpi: kolsinglis

source: sweep
tpi: brumim

source: sweet
tpi: swit

source: swell up
tpi: solap

source: swelling
tpi: buk

source: swim
tpi: suvim

source: sword grass
tpi: kunai

source: T
tpi: shirt

source: table
tpi: tebol

source: tail
tpi: tel

source: tailor
tpi: man bilong samapim klos

source: take
tpi: kisim

source: talk
tpi: tok

source: tall
tpi: long

source: tall tale
tpi: tok gumi

source: tap root
tpi: kil bilong diwai

source: tape
tpi: recorder

source: tapioca
tpi: tapiok

source: taste
tpi: traiim

source: tax
tpi: takis

source: taxi
tpi: taksi

source: tea
tpi: cup

source: teach
tpi: skulim

source: teacher
tpi: tisa

source: teapot
tpi: tipot

source: tease
tpi: hambakim

source: teeth
tpi: tit

source: telegram
tpi: wailis

source: telephone
tpi: telepon

source: television
tpi: bokis wailis wantem piksa

source: tell
tpi: tokim

source: tell lies to
tpi: giamanim

source: temperature
tpi: makim hat o kol

source: temple
tpi: haus lotu

source: tempt
tpi: traim

source: ten
tpi: tenpela

source: tenth
tpi: namba ten
